# SteelElemHoleSlotDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemHoleSlotDirection Property
ParameterTypeId Class See Also
---
"Along side 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemHoleSlotDirection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemHoleSlotDirection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemHoleSlotDirection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace